Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSystemPanel Property
 Can't create Curtain Panel in opening. The opening is probably too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSystemPanel { get; }
Public Shared ReadOnly Property CannotCreateSystemPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSystemPanel {
	FailureDefinitionId^ get ();
}
static member CannotCreateSystemPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace